Project/Toir.Adaptation/src/Catalogs/торо_СпособыСогласованияДокументов/торо_СпособыСогласованияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_СпособыСогласованияДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="02bc949c-5e4c-4b15-83c1-a8495643e26c">
    <name>ПорядокСогласования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="69807f2d-19a0-4039-9d55-8a6629b3ee9a">
      <name>гкс_ПроводитьАвтоматически</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e3f7b11a-33d2-425a-b6b6-a3b9d3451f37">
      <name>ПроведениеДокумента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="304f1d2e-c348-4b56-9d54-9d830aeb8100">
      <name>ТекущийСтатус</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="13294823-5282-48a7-ae3c-3980d87974ff">
      <name>Пользователь</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir.Adaptation/src/InformationRegisters/торо_ТекущиеСтатусыСогласованияДокументов/торо_ТекущиеСтатусыСогласованияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ТекущиеСтатусыСогласованияДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>СтатусДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>СогласуемыйДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/Catalogs/торо_СпособыСогласованияДокументов/ObjectModule.bsl
&После("ПередЗаписью")
Процедура гкс_ПередЗаписью(Отказ)
	// гкс+ [Релиз17] Деснол
	МассивУдаления = Новый Массив();
	Для Каждого СтрокаТаблицы Из Замещающие Цикл
		Если ПорядокСогласования.НайтиСтроки(Новый Структура("Пользователь,ТекущийСтатус", 
			СтрокаТаблицы.Пользователь, СтрокаТаблицы.ТекущийСтатус)).Количество() = 0 Тогда 
			МассивУдаления.Добавить(СтрокаТаблицы);
		КонецЕсли;
	КонецЦикла;
	Если МассивУдаления.Количество() Тогда 
		Для Каждого СтрокаМассива из МассивУдаления Цикл
			Замещающие.Удалить(СтрокаМассива);
		КонецЦикла;
	КонецЕсли;
	// гкс- [Релиз17]
КонецПроцедуры


&После("ПриЗаписи")
Процедура гкс_ПриЗаписи(Отказ)
	// проверить текущие задачи
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РегСтатусыСпособа.Статус КАК Статус
		|ПОМЕСТИТЬ ВТ_СтатусыСпособа
		|ИЗ
		|	РегистрСведений.торо_НастройкиСтатусовСогласованияДокументов КАК РегСтатусыСпособа
		|ГДЕ
		|	РегСтатусыСпособа.СпособСогласования = &СпособСогласования
		|	И РегСтатусыСпособа.СогласованиеЗавершено = ЛОЖЬ
		|	И РегСтатусыСпособа.НеОтображатьВСпискеЗадач = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РегТекущийСтатус.СогласуемыйДокумент КАК СогласуемыйДокумент,
		|	РегТекущийСтатус.СтатусДокумента КАК СтатусДокумента
		|ПОМЕСТИТЬ ВТ_ВсеДокументы
		|ИЗ
		|	ВТ_СтатусыСпособа КАК ВТ_СтатусыСпособа
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ТекущиеСтатусыСогласованияДокументов КАК РегТекущийСтатус
		|		ПО ВТ_СтатусыСпособа.Статус = РегТекущийСтатус.СтатусДокумента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ВсеДокументы.СогласуемыйДокумент КАК Документ,
		|	ВТ_ВсеДокументы.СогласуемыйДокумент.Организация КАК Организация,
		|	ВТ_ВсеДокументы.СтатусДокумента КАК Статус
		|ПОМЕСТИТЬ ВТ_НужныеДокументы
		|ИЗ
		|	ВТ_ВсеДокументы КАК ВТ_ВсеДокументы
		|ГДЕ
		|	ВТ_ВсеДокументы.СогласуемыйДокумент.СпособСогласования = &СпособСогласования
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ Различные
		|	ВТ_НужныеДокументы.Документ КАК Документ,
		|	торо_СтатусыСогласованияДокументовРемонтныхРабот.Пользователь КАК Пользователь
		|ИЗ
		|	ВТ_НужныеДокументы КАК ВТ_НужныеДокументы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_СтатусыСогласованияДокументовРемонтныхРабот КАК торо_СтатусыСогласованияДокументовРемонтныхРабот
		|		ПО ВТ_НужныеДокументы.Документ = торо_СтатусыСогласованияДокументовРемонтныхРабот.СогласуемыйДокумент
		|			И ВТ_НужныеДокументы.Статус = торо_СтатусыСогласованияДокументовРемонтныхРабот.Статус
		|ИТОГИ ПО
		|	Документ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ Различные
		|	ВТ_НужныеДокументы.Документ КАК Документ,
		|	ВТ_НужныеДокументы.Организация КАК Организация,
		|	ВТ_НужныеДокументы.Статус КАК Статус,
		|	Матрица.СледующийСтатус КАК СледующийСтатус
		|ИЗ
		|	ВТ_НужныеДокументы КАК ВТ_НужныеДокументы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_МатрицаПереходаСтатусовДокументов КАК Матрица
		|		ПО ВТ_НужныеДокументы.Статус = Матрица.ТекущийСтатус
		|			И (Матрица.СпособСогласования = &СпособСогласования)
		|ИТОГИ Максимум(Статус), Максимум(Организация) ПО
		|	Документ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ Различные
		|	ВТ_НужныеДокументы.Документ КАК Документ,
		|	торо_СтатусыСогласованияДокументовРемонтныхРабот.Статус КАК Статус,
		|	торо_СтатусыСогласованияДокументовРемонтныхРабот.Пользователь КАК Пользователь
		|ИЗ
		|	ВТ_НужныеДокументы КАК ВТ_НужныеДокументы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_СтатусыСогласованияДокументовРемонтныхРабот КАК торо_СтатусыСогласованияДокументовРемонтныхРабот
		|		ПО ВТ_НужныеДокументы.Документ = торо_СтатусыСогласованияДокументовРемонтныхРабот.СогласуемыйДокумент
		|			И Не ВТ_НужныеДокументы.Статус = торо_СтатусыСогласованияДокументовРемонтныхРабот.Статус
		|ИТОГИ ПО
		|	Документ ";
	
	Запрос.УстановитьПараметр("СпособСогласования", Ссылка);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();	
	НомерПакетаДок = 4;
	НомерПакетаПользователи = 3;
	НомерПакетаСтарых = 5;
	Если Не РезультатЗапроса[НомерПакетаДок].Пустой() Тогда 
		ВыборкаДок = РезультатЗапроса[НомерПакетаДок].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ВыборкаСоглДок = РезультатЗапроса[НомерПакетаПользователи].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ВыборкаСтарыхДок = РезультатЗапроса[НомерПакетаСтарых].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаДок.Следующий() Цикл
			// найти пользователей для следующих статусов
			АктуальныеПользователи = Новый Массив();
			ВыборкаДокСтатус = ВыборкаДок.Выбрать();
			Пока ВыборкаДокСтатус.Следующий() Цикл
				СтрПоиска = Новый Структура("ТекущийСтатус", ВыборкаДокСтатус.СледующийСтатус);
				Для Каждого СтрПорядок Из ПорядокСогласования.НайтиСтроки(СтрПоиска) Цикл
					Если АктуальныеПользователи.Найти(СтрПорядок.Пользователь) = Неопределено Тогда 
						АктуальныеПользователи.Добавить(СтрПорядок.Пользователь);
					КонецЕсли;
				КонецЦикла;
				Для Каждого СтрПорядок Из Замещающие.НайтиСтроки(СтрПоиска) Цикл
					Если АктуальныеПользователи.Найти(СтрПорядок.Замещающий) = Неопределено Тогда 
						АктуальныеПользователи.Добавить(СтрПорядок.Замещающий);
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			// сравнить с текущими
			МассивЛишних = Новый Массив();
			МассивНайденных = Новый Массив();
			ВыборкаСоглДок.Сбросить();
			Если ВыборкаСоглДок.НайтиСледующий(Новый Структура("Документ", ВыборкаДок.Документ)) Тогда 
				ВыборкаСогл = ВыборкаСоглДок.Выбрать();
				Пока ВыборкаСогл.Следующий() Цикл
					Если АктуальныеПользователи.Найти(ВыборкаСогл.Пользователь) = Неопределено Тогда 
						// лишний
						МассивЛишних.Добавить(ВыборкаСогл.Пользователь);
					Иначе
						МассивНайденных.Добавить(ВыборкаСогл.Пользователь);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			Если МассивНайденных.Количество() < АктуальныеПользователи.Количество() Тогда 
				Для Каждого Пользователь Из АктуальныеПользователи Цикл
					Если МассивНайденных.Найти(Пользователь) = Неопределено Тогда 
						// нужно создать задачу пользователю
						НЗ = РегистрыСведений.торо_СтатусыСогласованияДокументовРемонтныхРабот.СоздатьНаборЗаписей();
						НЗ.Отбор.СогласуемыйДокумент.Установить(ВыборкаДок.Документ);
						НЗ.Отбор.Статус.Установить(ВыборкаДок.Статус);
						НЗ.Отбор.Пользователь.Установить(Пользователь);
						НС = НЗ.Добавить();
						//НС.Дата должна быть пустой чтобы задача появилась в списке
						НС.Организация = ВыборкаДок.Организация;
						НС.СогласуемыйДокумент = ВыборкаДок.Документ;
						НС.Статус = ВыборкаДок.Статус;
						НС.Пользователь = Пользователь;
						НЗ.Записать();
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			// убрать лишние
			Для Каждого Пользователь Из МассивЛишних Цикл
				НЗ = РегистрыСведений.торо_СтатусыСогласованияДокументовРемонтныхРабот.СоздатьНаборЗаписей();
				НЗ.Отбор.СогласуемыйДокумент.Установить(ВыборкаДок.Документ);
				НЗ.Отбор.Статус.Установить(ВыборкаДок.Статус);
				НЗ.Отбор.Пользователь.Установить(Пользователь);
				НЗ.Записать();
			КонецЦикла;
			// убрать старые статусы
			ВыборкаСтарыхДок.Сбросить();
			Если ВыборкаСтарыхДок.НайтиСледующий(Новый Структура("Документ", ВыборкаДок.Документ)) Тогда 
				ВыборкаСтарых = ВыборкаСтарыхДок.Выбрать();
				Пока ВыборкаСтарых.Следующий() Цикл
					НЗ = РегистрыСведений.торо_СтатусыСогласованияДокументовРемонтныхРабот.СоздатьНаборЗаписей();
					НЗ.Отбор.СогласуемыйДокумент.Установить(ВыборкаДок.Документ);
					НЗ.Отбор.Статус.Установить(ВыборкаСтарых.Статус);
					НЗ.Отбор.Пользователь.Установить(ВыборкаСтарых.Пользователь);
					НЗ.Записать();
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
